### Where the Wildcards Are

* Suppose that you want to find out the name of an actor, but you only know that his last name begins with "Will." 

* Is there a way to display all actors whose names begin with those letters? 

* Yes, we can do so by using wildcards. A wildcard can be used to substitute zero, one, or multiple characters in a string. 

  ```sql
  SELECT *
  FROM actor
  WHERE last_name LIKE 'Will%';
  ```
  

* We identify the use of a wildcard with the keyword `LIKE`
* `%` tells us that our query can substitute zero, one, or multiple characters in its place. For example, all of the following will match: `Will`, `Willa`, and `Willows`. 

* The single character wildcard: `_` means that one, and only one, character must take its place in the query. 

  ```sql
  SELECT *
  FROM actor
  WHERE first_name LIKE '_AN';
  ```
  
* The query returns two names: `Dan` and `Ian`. Again, `LIKE` indicates the use of a wildcard, and `_AN` instructs MySQL to return all actors whose first name contains three letters, the second and third of which are "AN."


* Students will use the remaining time to practice using both wildcards.

In [1]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os
engine = create_engine('mysql+pymysql://root:kcmo1728@localhost/sakila')

## Remember!

* % is a printf special character in Python... so this will bomb out.

In [2]:
sql_query = """
  SELECT *
  FROM actor
  WHERE last_name LIKE 'Will%%';
"""
city = pd.read_sql_query(sql_query, engine)
city.head()

   actor_id first_name last_name         last_update
0        72       SEAN  WILLIAMS 2006-02-15 04:34:33
1       137     MORGAN  WILLIAMS 2006-02-15 04:34:33
2       172    GROUCHO  WILLIAMS 2006-02-15 04:34:33
3        83        BEN    WILLIS 2006-02-15 04:34:33
4        96       GENE    WILLIS 2006-02-15 04:34:33

In [3]:
sql_query = """
  SELECT *
  FROM actor
  WHERE first_name LIKE '_AN';
"""
city = pd.read_sql_query(sql_query, engine)
city.head()

   actor_id first_name last_name         last_update
0        18        DAN      TORN 2006-02-15 04:34:33
1        56        DAN    HARRIS 2006-02-15 04:34:33
2       116        DAN    STREEP 2006-02-15 04:34:33
3       155        IAN     TANDY 2006-02-15 04:34:33